package kv.vension.fastframe.core.mvp

/**
 * ========================================================================
 * 作 者：Vension
 * 主 页：Github: https://github.com/Vension
 * 日 期：2019/8/23 14:23
 *   ______       _____ _______ /\/|_____ _____            __  __ ______
 *  |  ____/\    / ____|__   __|/\/  ____|  __ \     /\   |  \/  |  ____|
 *  | |__ /  \  | (___    | |     | |__  | |__) |   /  \  | \  / | |__
 *  |  __/ /\ \  \___ \   | |     |  __| |  _  /   / /\ \ | |\/| |  __|
 *  | | / ____ \ ____) |  | |     | |    | | \ \  / ____ \| |  | | |____
 *  |_|/_/    \_\_____/   |_|     |_|    |_|  \_\/_/    \_\_|  |_|______|
 *
 * Take advantage of youth and toss about !
 * ------------------------------------------------------------------------
 * 描述：MVP-Presenter-接口
 * ========================================================================
 */
interface IPresenter<in V : IView> {

    /**
     *  绑定 View
     */
    fun attachView(iView: V)

    /**
     * 解绑 View
     * 在框架中 {@link Activity#onDestroy()} 时会默认调用 {@link IPresenter#detachView()}
     */
    fun detachView()

}